{
    "general": {
        "navItem0": "about me",
        "navItem1": "resume",
        "navItem2": "projects",
        "by": "by",
        "contact": "contact",
        "follow": "follow"
    },
    "aboutMe": {
        "hello": "Hello World",
        "ImIdo": "Here's who I am & what I do",
        "resume": "resume",
        "projects": "projects",
        "description": "I'm Civil Engineer and Full Stack Developer from Venezuela with 1 year and a half of experience in web3 technology development. Proficient in Vue.js, Nuxt.js, Firebase, and integrating APIs like Koios and Blockfrost for Cardano blockchain applications."
    },
    "resume": {
        "title": "Resume",
        "btn": "Download CV",
        "profile": {
            "title": "Profile",
            "content": "Junior Full Stack Developer with a year and a half of experience in web development using web3 technology. Knowledge in both frontend and backend development, excelling in crafting solutions and attractive user experiences. Proficient in Vue.js, Nuxt.js, and Firebase, as well as integrating APIs like Koios and Blockfrost to deliver advanced features in applications based on the Cardano blockchain."
        },
        "experience": {
            "title": "Experience",
            "history": [
                {
                    "company": "Blockchain Pilots",
                    "role": "Full Stack Developer",
                    "activities": [
                        "Worked within the Cardano blockchain ecosystem, integrating numerous functionalities using APIs such as Koios and Blockfrost to create comprehensive and feature-rich environments within our applications.",
                        "Participated in the creation and layout of responsive websites for clients and internal projects, employing technologies like HTML, CSS, and Vue.js.",
                        "Utilized Vue.js 2 and 3 as primary tools for application and website development, focusing on optimization, semantic enhancement, and design consistency for an optimal user experience.",
                        "Led larger-scale projects using Nuxt.js and TypeScript to achieve more efficient and maintainable results.",
                        "Implemented Firebase as the database and backend, leveraging Firebase Cloud Functions to ensure data security through filtering and validation.",
                        "Contributed to the development of a control panel that empowered clients with total project control, providing real-time statistics and testing capabilities for new features in NFT projects.",
                        "Built the foundation for an NFT viewer with support for multiple file types.",
                        "Led the development of an ongoing NFT game, orchestrating user wallet integration, matchmaking system with cancellation options, character selection mechanics, real-time gameplay implementation, and end-of-match result presentation. Implemented Firebase technologies, including transactions and Firestore, to establish a secure and immersive realtime gaming experience, with all data stored and accessible through a user-friendly scoreboard."
                    ]
                }
            ]
        },
        "skills": {
            "title": "Skills"
        },
        "languages": {
            "title": "Languages"
        },
        "education": {
            "title": "Education",
            "history": [
                {
                    "degree": "Civil engineering",
                    "description": "During my Civil Engineering career, I acquired a series of knowledge and skills that can be applied in an interesting way in web development. Although at first glance they seem very different disciplines, there are areas of convergence that allow to take advantage of what I learned in Civil Engineering to improve and enrich the practice of web development."
                }
            ]
        },
        "references": {
            "title": "References"
        }
    },
    "projects": {
        "title": "Projects",
        "description": "I'm thrilled to present a curated selection of projects that highlight my diverse skills and expertise. From captivating frontend designs crafted with HTML, CSS, and JavaScript to robust backend systems built on technologies like Node.js and Firebase, each project reflects my commitment to delivering clean, efficient, and user-friendly solutions.",
        "projects": [
            {
                "title": "Blockchain Pilots Website",
                "company": "Blockchain Pilots",
                "status": "is live",
                "url": "https://blockchainpilots.io/",
                "description": "Blockchain Pilots offer an array of services and tools, whether you’re a new or established business or project. We have experience in delivering on comprehensive software and consulting needs such as web3 development, stake pools, NFT minting, artwork layering and chain data manipulation."
            },
            {
                "title": "TokenPerkz Website",
                "company": "Blockchain Pilots",
                "status": "is live",
                "url": "https://tokenperkz.com/",
                "description": "TokenPerkz is an innovative portal, which allows holders of your NFTs to see locked content provided by you. This can include images, videos, demos, testing areas, live streams, an NFT store, an e-commerce merch store, reward points and more."
            },
            {
                "title": "Springboard Website",
                "company": "Blockchain Pilots",
                "status": "is live",
                "url": "https://springboardnft.com/",
                "description": "Springboard is made up of a group of NFT enthusiasts with the aim to help raise awareness of the independent creative talents on the Cardano Blockchain. The power of Art NFTs lies in the connection between the Artist and the market. By offering services such as minting, auctions and Artist compilation drops."
            },
            {
                "title": "RetroNFTs Website",
                "company": "Blockchain Pilots",
                "status": "is live",
                "url": "https://retronfts.art/",
                "description": "RetroNFTs was founded in 2021 by two crypto-enthusiasts, Nathan and Terry, with the aim of doing things a little differently. The duo specialise in building relationships with emerging artists, helping them expose their talent to a global network using the Cardano blockchain to create collectible NFTs."
            },
            {
                "title": "Trait Wars NFT Game",
                "company": "Blockchain Pilots",
                "status": "in process",
                "url": "https://blockchainpilots.io/",
                "description": "Trait Wars is a turn-based strategy game built on the ADA Invadaz platform. Trait Wars will pit Zaguris against each other in a series of 1 v 1 battles until a Grand Champion is found! Anyone with a Zaguri can play, and earn $invada while doing it. Trait Wars will combine luck and skill, as players will need to choose their hero and when to use their boosters carefully."
            },
            {
                "title": "Dungeon RPG Clicker Game",
                "company": "Personal Project",
                "status": "in process",
                "url": "https://blockchainpilots.io/",
                "description": "RPG Game with Node.js, Express, and MongoDB: Created a small RPG game as a personal project to enhance my skills in backend development. Employed Node.js and Express to build the server infrastructure, and MongoDB to store game data."
            },
            {
                "title": "NFT Cardano Viewer",
                "company": "Blockchain Pilots",
                "status": "in process",
                "url": "https://blockchainpilots.io/",
                "description": "The application provides users with an intuitive interface for viewing their NFTs, verifying authenticity and analyzing the metadata of each NFT in detail. It supports HTML, mp3, mp4 and image files."
            }
        ]
    }
}